tap "caskroom/fonts"
tap "caskroom/versions"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Programmable completion for Bash 3.2
brew "bash-completion"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# CLI tool for quick access to files and directories
brew "fasd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Database migrations CLI tool
brew "golang-migrate"
# SSL/TLS cryptography library
brew "openssl"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Colorize logfiles and command output
brew "grc"
# Add GitHub support to git on the command-line
brew "hub"
# Rainbows and unicorns in your console!
brew "lolcat"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Perl compatible regular expressions library
brew "pcre"
# Simplistic interactive filtering tool
brew "peco"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql"
# Show ps output as a tree
brew "pstree"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Powerful, clean, object-oriented scripting language
brew "ruby"
# netcat on steroids
brew "socat"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# The next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
cask "dozer"
cask "powershell"
cask "caskroom/fonts/font-inconsolata-nerd-font"
cask "caskroom/fonts/font-meslo-nerd-font"
cask "caskroom/fonts/font-roboto-mono"
cask "caskroom/versions/java8"
